jpcornil-git/ayab-esp32/sdkconfig.defaults
# UnoR4 target
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
# Custom partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
# Logs
CONFIG_BOOT_ROM_LOG_ALWAYS_OFF=y
CONFIG_LOG_COLORS=y
# HTTPD
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_WS_SUPPORT=y